app/Controllers/Admin/AdminDashboardController.php

SELECT SUM(`gudang_jumlah`) AS `gudang_jumlah`
FROM `gudang`
SELECT SUM(`barang_jumlah`) AS `barang_jumlah`
FROM `barang`
SELECT COUNT(`suplier_nama`) AS `suplier_nama`
FROM `suplier`
SELECT SUM(`barangmasuk_jumlah`) AS `barangmasuk_jumlah`
FROM `barangmasuk`
SELECT SUM(`barangkeluar_jumlah`) AS `barangkeluar_jumlah`
FROM `barangkeluar`
SELECT COUNT(`pengguna_nama`) AS `pengguna_nama`
FROM `pengguna`
SELECT COUNT(`ruangan_nama`) AS `ruangan_nama`
FROM `ruangan`
---
    public function index()
    {
        // Load models
        $gudangModel = new GudangModel();
        $barangModel = new BarangModel();
        $barangModel = new BarangModel();
        $suplierModel = new SuplierModel();
        $barangMasukModel = new BarangMasukModel();
        $barangKeluarModel = new BarangKeluarModel();
        $penggunaModel = new PenggunaModel();
        $ruanganModel = new RuanganModel();

        // Get total sum from gudang_jumlah
        $totalGudangBarang = $gudangModel->selectSum('gudang_jumlah')->get()->getRow()->gudang_jumlah;

        // Get total sum from barang_jumlah
        $totalBarang = $barangModel->selectSum('barang_jumlah')->get()->getRow()->barang_jumlah;

        // Get total sum from barang_jumlah
        $totalBarangRuangan = $barangModel->selectSum('barang_jumlah')->get()->getRow()->barang_jumlah;

        // Get total count from suplier_nama
        $totalSuplier = $suplierModel->selectCount('suplier_nama')->get()->getRow()->suplier_nama;

        // Get total sum from barangmasuk_jumlah
        $totalBarangMasuk = $barangMasukModel->selectSum('barangmasuk_jumlah')->get()->getRow()->barangmasuk_jumlah;

        // Get total sum from barangkeluar_jumlah
        $totalBarangKeluar = $barangKeluarModel->selectSum('barangkeluar_jumlah')->get()->getRow()->barangkeluar_jumlah;

        // Get total count from pengguna_nama
        $totalPengguna = $penggunaModel->selectCount('pengguna_nama')->get()->getRow()->pengguna_nama;

        // Get total count from ruangan_nama
        $totalRuangan = $ruanganModel->selectCount('ruangan_nama')->get()->getRow()->ruangan_nama;