app/Controllers/Login/LoginController.php

SELECT *
FROM `pengguna`
WHERE `pengguna_username` = 'rifasmat'
 LIMIT 1
---
    public function processLogin()
    {
        $penggunaModel = new PenggunaModel();

        // Ambil data dari form
        $username = filter_var($this->request->getPost('username'), FILTER_SANITIZE_FULL_SPECIAL_CHARS);
        $password = filter_var($this->request->getPost('password'), FILTER_SANITIZE_FULL_SPECIAL_CHARS);

        // validasi input username dan password
        if (empty($username) && empty($password)) {
            return redirect()->to(base_url('login'))->with('message', 'Username dan password tidak boleh kosong');
        } elseif (empty($username)) {
            return redirect()->to(base_url('login'))->with('message', 'Username tidak boleh kosong');
        } elseif (empty($password)) {
            return redirect()->to(base_url('login'))->with('message', 'Password tidak boleh kosong');
        }

        // Cari pengguna berdasarkan username
        $pengguna = $penggunaModel->where('pengguna_username', $username)->first();