app/Models/BarangKeluarModel.php

SELECT *
FROM `barangkeluar`
ORDER BY `created_at` DESC
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `barangkeluar`
---
    public function getBarang($limit = 15, $offset = 0)
    {
        return $this->orderBy('created_at', 'DESC')->paginate($limit, 'default', $offset);