app/Models/FasilitasModel.php

SELECT *
FROM `fasilitas`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `fasilitas`
---
    public function getFasilitas($limit = 10, $offset = 0)
    {
        return $this->orderBy('created_at', 'DESC')->paginate($limit, 'default', $offset);