app/Models/PenggunaModel.php

    public function getProfilPenggunaById($id)
    {
        return $this->asArray()
            ->where(['pengguna_id' => $id])
            ->first();
---
SELECT *
FROM `pengguna`
WHERE `pengguna_id` = '1'
 LIMIT 1