app/Models/SuplierModel.php

    public function getSuplier($limit = 15, $offset = 0)
    {
        return $this->orderBy('created_at', 'DESC')->paginate($limit, 'default', $offset);
---
SELECT *
FROM `suplier`
ORDER BY `created_at` DESC
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `suplier`